heardrwt/Xiaomi-M365-Display/nRF5_SDK/examples/ble_peripheral/experimental_ble_app_queued_writes/main.c
/**@brief Function for handling the Queued Write Example Service events.
 *
 * @details This function will be called for all Queued Write Example Service events which are passed to
 *          the application.
 *
 * @param[in]   p_qwrs   Queued Write Example Service structure.
 * @param[in]   p_evt    Event received from the Queued Write Example Service.
 *
 */
static uint16_t queued_write_example_service_evt_handler(nrf_ble_qwrs_t     * p_qwrs,
                                                         nrf_ble_qwrs_evt_t * p_evt)
{
    uint16_t ret_val = BLE_GATT_STATUS_SUCCESS;

    switch (p_evt->evt_type)
    {
        case BLE_QWRS_CHECK_RCVD_DATA:
            /*This is where your application can check the received value before accepting the write*/
            NRF_LOG_INFO("QWRS_CHECK_RCVD_DATA\r\n");
            if (p_evt->rcvd_data[0] == 0)
            {
                NRF_LOG_INFO("First byte is 0, reject the operation\r\n");
                ret_val =  BLE_GATT_STATUS_ATTERR_INSUF_AUTHORIZATION;
            }
            else
            {
                NRF_LOG_INFO("First byte is not 0, accept the operation\r\n");
                ret_val =  BLE_GATT_STATUS_SUCCESS;
            }
            break;//BLE_QWRS_CHECK_RCVD_DATA

        case BLE_QWRS_NEW_DATA_RCVD:
            NRF_LOG_INFO("BLE_QWRS_NEW_DATA_RCVD\r\n");
            /*This is where the data is actually received and has been accepted. The actual data can be retreived using */
            break;//BLE_QWRS_NEW_DATA_RCVD

        default:
            // No implementation needed.
            break;
    }
    return ret_val;
}

/**@brief Function for handling events from the Queued Write module.
 */
uint16_t queued_write_handler(nrf_ble_qwr_t * p_qwr, nrf_ble_qwr_evt_t * p_evt)
{
    return nrf_ble_qwrs_on_qwr_evt(&m_qwrs, p_qwr, p_evt);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t           err_code;
    nrf_ble_qwr_init_t   qwr_init;
    nrf_ble_qwrs_init_t  qwrs_init;

    // Initialize Queued Write Module
    qwr_init.mem_buffer.len   = MEM_BUFF_SIZE;
    qwr_init.mem_buffer.p_mem = m_buffer;
    qwr_init.error_handler    = service_error_handler;
    qwr_init.callback         = queued_write_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    //initialize the Queued Writes Example Service
    memset(&qwrs_init, 0, sizeof(qwrs_init));

    qwrs_init.evt_handler   = queued_write_example_service_evt_handler;
    qwrs_init.error_handler = service_error_handler;
    qwrs_init.p_qwr_ctx     = &m_qwr;

    err_code = nrf_ble_qwrs_init(&qwrs_init, &m_qwrs);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
*/
static void application_timers_start(void)
{
    /* YOUR_JOB: Start your timers. below is an example of how to start a timer.
    uint32_t err_code;
    err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code); */

}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising\r\n");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            sleep_mode_enter();
            break;
        default:
            break;
    }
}


